{
    "title": "Sub-process, multi-tenant runtime for HTTP applications using node.js",
    "abstract": "Can we reduce the cost running certain class of applications in datacenters by the factor of ten?\nIn this talk I will present a node.js-based, multi-tenant runtime for hosting HTTP APIs within a single process. The key objective of this talk is to determine if we can substantially reduce the cost of hosting HTTP APIs written in node.js by securely and reliably sharing resources of a single process across multiple tenants. I will discuss the technical approach to data isolation and handling of local denial of service attacks. I will explore the implications for the programming model and the relevance of the approach to a class of applications. I will walk through the challenges that remain. Finally, I may even squeeze in a joke or two.\nMany web applications created today are deployed in shared hosting environments. The cost of hosting these applications incurred by the hosting company is the primary factor affecting the price of the hosting plan offered to end users. Hosting companies support a range of hosting plans: from empty rack space in a data center, to managed physical machines, to virtual machines, and finally to individual OS processes (the plans that do not support “root level” access). The price of a hosting plan decreases as more web applications from different tenants share the same set of resources in a data center, with managed machines costing tens or hundreds of dollars per month all the way down to the least expensive shared hosting plans that cost a few bucks.\nThe hypothesis I want to put to test with haiku-http (https://tjanczuk.github.com/haiku-http) is that by sharing the resources of a single OS process (memory, handles, threads) across multiple applications we can run more applications on a single machine, and therefore reduce the marginal cost of hosting such applications compared to dedicating an entire OS process to each of them.\nIn this talk I will show measurements that reflect the size of the opportunity for reducing the cost of running applications from multiple tenants at sub-process density. I will present the challenges and solutions related to ensuring data isolation between code from multiple tenants running in a single node.js process. I will also discuss a range of local denial of service attacks related to resource consumption such environment must be resilient to, and ways of handling these attacks.\nBeyond talking, I will be showing a lot of running code.\nFind out more at https://tjanczuk.github.com/haiku-http. ",
    "speaker" : {
        "name": "Tomasz Janczuk",
        "bio": "I have spent the last 11 years helping to develop and ship software for Microsoft. My current area of focus is node.js, JavaScript, and Windows Azure. Before that I worked on .NET Framework and Silverlight, specializing in web service technologies, in particular security. I am presently engaged in technical investigations related to reducing the cost of running applications in data centers. I also enjoy driving a few open source projects. When not in front of my computer, I like hiking, skiing, diving, climbing, and sailing with my family in the beautiful Pacific Northwest.",
        "twitter": "tjanczuk",
        "blog": "http://tomasz.janczuk.org",
        "photo": "http://2.bp.blogspot.com/_NUp_nWDyyvI/S0E4LaVBrmI/AAAAAAAABQ4/qtgB80y4O38/S220-h/D70-100-3785.jpg",
        "country": "USA"
    }
}